Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/iar/iar/startup_pic32ck2051gc01144.c
/**
 * \file
 *
 * \brief IAR startup file for PIC32CK2051GC01144
 *
 * Copyright (c) 2022 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include "pic32ck2051gc01144.h"

typedef void (*intfunc) (void);
typedef union { intfunc __fun; void * __ptr; } intvec_elem;

void __iar_program_start(void);
int __low_level_init(void);

/* Reset handler */
void Reset_Handler(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M33 core handlers */
#pragma weak NonMaskableInt_Handler=Dummy_Handler
#pragma weak HardFault_Handler=Dummy_Handler
#pragma weak MemoryManagement_Handler=Dummy_Handler
#pragma weak BusFault_Handler=Dummy_Handler
#pragma weak UsageFault_Handler=Dummy_Handler
#pragma weak SecureFaultMonitor_Handler=Dummy_Handler
#pragma weak SVCall_Handler=Dummy_Handler
#pragma weak DebugMonitor_Handler=Dummy_Handler
#pragma weak PendSV_Handler=Dummy_Handler
#pragma weak SysTick_Handler=Dummy_Handler

/* Peripherals handlers */
#pragma weak FCR_ERR_Handler=Dummy_Handler
#pragma weak FCR_FLT_Handler=Dummy_Handler
#pragma weak FCW_Handler=Dummy_Handler
#pragma weak PM_Handler=Dummy_Handler
#pragma weak SUPC_Handler=Dummy_Handler
#pragma weak OSCCTRL_XOSC_Handler=Dummy_Handler
#pragma weak OSCCTRL_DFLL_Handler=Dummy_Handler
#pragma weak OSCCTRL_PLL0_Handler=Dummy_Handler
#pragma weak OSC32KCTRL_Handler=Dummy_Handler
#pragma weak MCLK_Handler=Dummy_Handler
#pragma weak FREQM_Handler=Dummy_Handler
#pragma weak WDT_Handler=Dummy_Handler
#pragma weak RTC_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_0_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_1_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_2_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_3_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_4_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_5_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_6_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_7_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_8_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_9_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_10_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_11_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_12_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_13_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_14_Handler=Dummy_Handler
#pragma weak EIC_EXTINT_15_Handler=Dummy_Handler
#pragma weak EIC_NSCHK_Handler=Dummy_Handler
#pragma weak PAC_Handler=Dummy_Handler
#pragma weak TRAM_Handler=Dummy_Handler
#pragma weak PORT_Handler=Dummy_Handler
#pragma weak DMA0_PRI0_Handler=Dummy_Handler
#pragma weak DMA0_PRI1_Handler=Dummy_Handler
#pragma weak DMA0_PRI2_Handler=Dummy_Handler
#pragma weak DMA1_PRI0_Handler=Dummy_Handler
#pragma weak DMA1_PRI1_Handler=Dummy_Handler
#pragma weak HMATRIX_Handler=Dummy_Handler
#pragma weak EVSYS_0_Handler=Dummy_Handler
#pragma weak EVSYS_1_Handler=Dummy_Handler
#pragma weak EVSYS_2_Handler=Dummy_Handler
#pragma weak EVSYS_3_Handler=Dummy_Handler
#pragma weak EVSYS_OTHER_Handler=Dummy_Handler
#pragma weak SERCOM0_56_Handler=Dummy_Handler
#pragma weak SERCOM0_0_Handler=Dummy_Handler
#pragma weak SERCOM0_1_Handler=Dummy_Handler
#pragma weak SERCOM0_2_Handler=Dummy_Handler
#pragma weak SERCOM0_3_Handler=Dummy_Handler
#pragma weak SERCOM0_4_Handler=Dummy_Handler
#pragma weak SERCOM1_56_Handler=Dummy_Handler
#pragma weak SERCOM1_0_Handler=Dummy_Handler
#pragma weak SERCOM1_1_Handler=Dummy_Handler
#pragma weak SERCOM1_2_Handler=Dummy_Handler
#pragma weak SERCOM1_3_Handler=Dummy_Handler
#pragma weak SERCOM1_4_Handler=Dummy_Handler
#pragma weak SERCOM2_56_Handler=Dummy_Handler
#pragma weak SERCOM2_0_Handler=Dummy_Handler
#pragma weak SERCOM2_1_Handler=Dummy_Handler
#pragma weak SERCOM2_2_Handler=Dummy_Handler
#pragma weak SERCOM2_3_Handler=Dummy_Handler
#pragma weak SERCOM2_4_Handler=Dummy_Handler
#pragma weak SERCOM3_56_Handler=Dummy_Handler
#pragma weak SERCOM3_0_Handler=Dummy_Handler
#pragma weak SERCOM3_1_Handler=Dummy_Handler
#pragma weak SERCOM3_2_Handler=Dummy_Handler
#pragma weak SERCOM3_3_Handler=Dummy_Handler
#pragma weak SERCOM3_4_Handler=Dummy_Handler
#pragma weak TCC0_OTHER_Handler=Dummy_Handler
#pragma weak TCC0_MC_0_Handler=Dummy_Handler
#pragma weak TCC0_MC_1_Handler=Dummy_Handler
#pragma weak TCC0_MC_2_Handler=Dummy_Handler
#pragma weak TCC0_MC_3_Handler=Dummy_Handler
#pragma weak TCC0_MC_4_Handler=Dummy_Handler
#pragma weak TCC0_MC_5_Handler=Dummy_Handler
#pragma weak TCC1_OTHER_Handler=Dummy_Handler
#pragma weak TCC1_MC_0_Handler=Dummy_Handler
#pragma weak TCC1_MC_1_Handler=Dummy_Handler
#pragma weak TCC1_MC_2_Handler=Dummy_Handler
#pragma weak TCC1_MC_3_Handler=Dummy_Handler
#pragma weak TCC1_MC_4_Handler=Dummy_Handler
#pragma weak TCC1_MC_5_Handler=Dummy_Handler
#pragma weak TCC2_OTHER_Handler=Dummy_Handler
#pragma weak TCC2_MC_0_Handler=Dummy_Handler
#pragma weak TCC2_MC_1_Handler=Dummy_Handler
#pragma weak TCC2_MC_2_Handler=Dummy_Handler
#pragma weak TCC2_MC_3_Handler=Dummy_Handler
#pragma weak TCC2_MC_4_Handler=Dummy_Handler
#pragma weak TCC2_MC_5_Handler=Dummy_Handler
#pragma weak TCC3_OTHER_Handler=Dummy_Handler
#pragma weak TCC3_MC_0_Handler=Dummy_Handler
#pragma weak TCC3_MC_1_Handler=Dummy_Handler
#pragma weak TCC3_MC_2_Handler=Dummy_Handler
#pragma weak TCC3_MC_3_Handler=Dummy_Handler
#pragma weak TCC3_MC_4_Handler=Dummy_Handler
#pragma weak TCC3_MC_5_Handler=Dummy_Handler
#pragma weak SERCOM4_56_Handler=Dummy_Handler
#pragma weak SERCOM4_0_Handler=Dummy_Handler
#pragma weak SERCOM4_1_Handler=Dummy_Handler
#pragma weak SERCOM4_2_Handler=Dummy_Handler
#pragma weak SERCOM4_3_Handler=Dummy_Handler
#pragma weak SERCOM4_4_Handler=Dummy_Handler
#pragma weak SERCOM5_56_Handler=Dummy_Handler
#pragma weak SERCOM5_0_Handler=Dummy_Handler
#pragma weak SERCOM5_1_Handler=Dummy_Handler
#pragma weak SERCOM5_2_Handler=Dummy_Handler
#pragma weak SERCOM5_3_Handler=Dummy_Handler
#pragma weak SERCOM5_4_Handler=Dummy_Handler
#pragma weak SERCOM6_56_Handler=Dummy_Handler
#pragma weak SERCOM6_0_Handler=Dummy_Handler
#pragma weak SERCOM6_1_Handler=Dummy_Handler
#pragma weak SERCOM6_2_Handler=Dummy_Handler
#pragma weak SERCOM6_3_Handler=Dummy_Handler
#pragma weak SERCOM6_4_Handler=Dummy_Handler
#pragma weak SERCOM7_56_Handler=Dummy_Handler
#pragma weak SERCOM7_0_Handler=Dummy_Handler
#pragma weak SERCOM7_1_Handler=Dummy_Handler
#pragma weak SERCOM7_2_Handler=Dummy_Handler
#pragma weak SERCOM7_3_Handler=Dummy_Handler
#pragma weak SERCOM7_4_Handler=Dummy_Handler
#pragma weak TCC4_OTHER_Handler=Dummy_Handler
#pragma weak TCC4_MC_0_Handler=Dummy_Handler
#pragma weak TCC4_MC_1_Handler=Dummy_Handler
#pragma weak TCC5_OTHER_Handler=Dummy_Handler
#pragma weak TCC5_MC_0_Handler=Dummy_Handler
#pragma weak TCC5_MC_1_Handler=Dummy_Handler
#pragma weak TCC6_OTHER_Handler=Dummy_Handler
#pragma weak TCC6_MC_0_Handler=Dummy_Handler
#pragma weak TCC6_MC_1_Handler=Dummy_Handler
#pragma weak TCC7_OTHER_Handler=Dummy_Handler
#pragma weak TCC7_MC_0_Handler=Dummy_Handler
#pragma weak TCC7_MC_1_Handler=Dummy_Handler
#pragma weak ADC_0_Handler=Dummy_Handler
#pragma weak ADC_1_Handler=Dummy_Handler
#pragma weak ADC_2_Handler=Dummy_Handler
#pragma weak ADC_3_Handler=Dummy_Handler
#pragma weak ADC_4_Handler=Dummy_Handler
#pragma weak ADC_5_Handler=Dummy_Handler
#pragma weak AC_Handler=Dummy_Handler
#pragma weak PTC_Handler=Dummy_Handler
#pragma weak SPI_IXS_Handler=Dummy_Handler
#pragma weak PCC_Handler=Dummy_Handler
#pragma weak PDEC_Handler=Dummy_Handler
#pragma weak CAN0_Handler=Dummy_Handler
#pragma weak CAN1_Handler=Dummy_Handler
#pragma weak ETH_Handler=Dummy_Handler
#pragma weak SQI_Handler=Dummy_Handler
#pragma weak TRNG_Handler=Dummy_Handler
#pragma weak SDMMC0_Handler=Dummy_Handler
#pragma weak SDMMC1_Handler=Dummy_Handler
#pragma weak USB_OTHER_Handler=Dummy_Handler
#pragma weak USB_SOF_Handler=Dummy_Handler
#pragma weak USB_TRCPT0_Handler=Dummy_Handler
#pragma weak USB_TRCPT1_Handler=Dummy_Handler
#pragma weak USBHS_Handler=Dummy_Handler

/* Exception Table */
#pragma language = extended
#pragma segment = "CSTACK"

/* The name "__vector_table" has special meaning for C-SPY: */
/* it is where the SP start value is found, and the NVIC vector */
/* table register (VTOR) is initialized to this address if != 0 */

#pragma section = ".intvec"
#pragma location = ".intvec"
const DeviceVectors __vector_table = {
        (void*) __sfe("CSTACK"),

        .pfnReset_Handler              = (void*) Reset_Handler,
        .pfnNonMaskableInt_Handler     = (void*) NonMaskableInt_Handler,
        .pfnHardFault_Handler          = (void*) HardFault_Handler,
        .pfnMemoryManagement_Handler   = (void*) MemoryManagement_Handler,
        .pfnBusFault_Handler           = (void*) BusFault_Handler,
        .pfnUsageFault_Handler         = (void*) UsageFault_Handler,
        .pfnSecureFaultMonitor_Handler = (void*) SecureFaultMonitor_Handler,
        .pvReservedC8                  = (void*) (0UL), /* Reserved */
        .pvReservedC7                  = (void*) (0UL), /* Reserved */
        .pvReservedC6                  = (void*) (0UL), /* Reserved */
        .pfnSVCall_Handler             = (void*) SVCall_Handler,
        .pfnDebugMonitor_Handler       = (void*) DebugMonitor_Handler,
        .pvReservedC3                  = (void*) (0UL), /* Reserved */
        .pfnPendSV_Handler             = (void*) PendSV_Handler,
        .pfnSysTick_Handler            = (void*) SysTick_Handler,

